#pragma once
#include "Account.h"
#include <iostream>
using namespace std;
class Bankomat
{
	Account *m_a;
	static Money m_bank;
public:
	Bankomat(Account *a)
	{
        // б дюммнл яксвюе рш опнярн йнохпсеьэ сйюгюрекэ, ю ме дюммше,
        // онщрнлс днярсо й m_a, еярэ х с бмеьмеи тсмйжхх (хг йнрнпни
        // ашк оепедюм сйюгюрекэ a), щрн мюпсьюер опхмжхо хмйюояскъжхх
        // х бннаые бед╗р й мейнппейрмни пюанре йкюяяю Bankomat, рюй
        // йюй ецн бмсрпеммхе дюммше лнцср ашрэ хглемемш аег беднлю
        // яюлнцн йкюяяю
        // онщрнлс мюдн бшонкмърэ "цксанйне йнохпнбюмхе", рн еярэ бшдекхрэ
        // оюлърэ онд сйюгюрекэ m_a опх онлных new х б щрс оюлърэ яйнохпнбюрэ
        // дюммше, мю йнрнпше сйюгшбюер a
        // мн щрн б дюммнл яксвюе нвемэ якнфмн х ме мсфмн
        // ксвье назъбхрэ Account m_a,  Account a х рнцдю
        // опх опхябюхбюмхх асдер бшгшбюрэяъ ноепюрнп йнохпнбюмхъ, йнрнпши бя╗
        // ядекюер опюбхкэмн, ю еы╗ ксвье бняонкэгнбюрэяъ яохяйнл хмхжхюкхгюжхх
        // Bankomat(Account a): m_a(a) {}
        // х рнцдю асдер бшгбюм йнмярпсйрнп йнохпнбюмхъ (б рбн╗л бюпхюмре
        // ямювюкю бшгнберяъ йнмярпсйрнп он слнквюмхч, ю онрнл ноепюрнп
        // йнохпнбюмхъ гюохьер мсфмше дюммше - дбю ьюцю, блеярн ндмнцн)
		m_a = a;
	}
	void GetCash(int R, int K)
	{
		Money t_bank(R, K);
		if (m_bank < t_bank)
		{
			cout << "\nхГБХМХРЕ, Б АЮМЙНЛЮРЕ МЕДНЯРЮРНВМН ЯПЕДЯРБ. нОЕПЮЖХЪ НРЛЕМЕМЮ";
		}
		else
		{
			if (!m_a->GetCash(R, K))
			{
				m_bank = m_bank-t_bank;
				cout << "\nсЯОЕЬМН";
			}
		}
	}
	void PutCash(int R, int K)
	{
		if (!m_a->PutCash(R, K))
		{
			m_bank = m_bank + Money(R, K);
			cout << "\nсЯОЕЬМН";
		}
	}
};

